In [1]:
import pandas as pd

In [2]:

record1=pd.Series({'Name':'alice','Class':'pyhsic','Score':85})

record2=pd.Series({'Name':'Jacl','class':'comp','Score':82})


record3=pd.Series({'Name':'Hellen','Class':'Math','Score':100})

In [3]:
df=pd.DataFrame([record1,record2,record3],index=['school1','school2','school3'])
df.head()

           Name   Class  Score class
school1   alice  pyhsic     85   NaN
school2    Jacl     NaN     82  comp
school3  Hellen    Math    100   NaN

In [4]:
students=[{'Name':'alice','class':'pyhsic','Score':85},{'Name':'Jacl','class':'comp','Score':82},{'Name':'Hellen','class':'Math','Score':100}]
df=pd.DataFrame(students,index=['school1','school2','school3'])
df.head()

           Name   class  Score
school1   alice  pyhsic     85
school2    Jacl    comp     82
school3  Hellen    Math    100

In [5]:
# similar with series we can use iloc and loc

df.loc["school1"]

Name      alice
class    pyhsic
Score        85
Name: school1, dtype: object

In [6]:
type(df.loc['school2'])

pandas.core.series.Series

In [7]:
df.loc['school1']

Name      alice
class    pyhsic
Score        85
Name: school1, dtype: object

In [8]:
df.loc['school1','Name']

'alice'

In [9]:
df.T

      school1 school2 school3
Name    alice    Jacl  Hellen
class  pyhsic    comp    Math
Score      85      82     100

In [10]:
df.T.loc['Name']

school1     alice
school2      Jacl
school3    Hellen
Name: Name, dtype: object

In [11]:
df['Name']

school1     alice
school2      Jacl
school3    Hellen
Name: Name, dtype: object

In [12]:
df.loc['school1']['Name']

'alice'

In [13]:
df.loc['school1']['Name']

'alice'

In [14]:
# if we wanted to slect all rows we can use a colon to indicate a full slice from  to end

In [15]:
df.loc[:,['Name','Score']]

           Name  Score
school1   alice     85
school2    Jacl     82
school3  Hellen    100

In [16]:
df.drop('school1')

           Name class  Score
school2    Jacl  comp     82
school3  Hellen  Math    100

In [17]:
df
# data still normal after drtop

           Name   class  Score
school1   alice  pyhsic     85
school2    Jacl    comp     82
school3  Hellen    Math    100

In [18]:
copy_df=df.copy()
copy_df.drop('Name',inplace=True,axis=1)
copy_df

          class  Score
school1  pyhsic     85
school2    comp     82
school3    Math    100

In [19]:
# del copy_df['class']
# this will immidiate delte the data we want and it will no longer in the mem
copy_df

          class  Score
school1  pyhsic     85
school2    comp     82
school3    Math    100

In [22]:
# add new class
df['ClassRanking']=None
# df.add('school3',[{'Name':'alice','Class':'pyhsic','Score':85}])
school4=[{'Name':'alice','class':'pyhsic','Score':85}]
df

pd.DataFrame(df,index=[1,2,3,4])

           Name   class  Score ClassRanking
school1   alice  pyhsic     85         None
school2    Jacl    comp     82         None
school3  Hellen    Math    100         None